In [1]:
import pandas as pd
from config import pw

In [2]:
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect

In [3]:
# create df from the csv
aqi_csv = "resources/Pollution_day_2001-2016.csv"
aqi_df = pd.read_csv(aqi_csv)

In [4]:
aqi_df['Date Local'] = pd.to_datetime(aqi_df['Date Local'])
aqi_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 326754 entries, 0 to 326753
Data columns (total 7 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Date Local  326754 non-null  datetime64[ns]
 1   State       326754 non-null  object
 2   County      326754 non-null  object
 3   NO2 AQI     326754 non-null  float64
 4   O3 AQI      326754 non-null  float64
 5   SO2 AQI     326754 non-null  float64
 6   CO AQI      326605 non-null  float64
dtypes: datetime64[ns](1), float64(4), object(2)
memory usage: 17.5+ MB

In [5]:
df_grouper = aqi_df.groupby(['State', pd.Grouper(key= 'Date Local', freq= "Y")]).mean()
df_grouper

                      NO2 AQI     O3 AQI    SO2 AQI    CO AQI
State   Date Local
Alabama 2013-12-31  21.387097  18.903226   6.580645  4.129032
        2014-12-31  21.486755  36.947020   7.956954  3.715232
        2015-12-31  20.026667  37.343333   6.950000  3.933333
        2016-12-31  23.093960  39.295302   5.275168  3.906040
Alaska  2014-12-31  21.167598  15.206704  14.000000  6.983240
...                       ...        ...        ...       ...
Wyoming 2012-12-31  11.709722  40.455556   3.986111  2.636111
        2013-12-31  11.217270  41.284123   0.690808  0.824022
        2014-12-31   8.967816  44.809195   0.547126  0.442396
        2015-12-31   9.371058  43.035250   1.916512  0.713755
        2016-12-31  10.288889  41.077778   0.200000  1.155556

[496 rows x 4 columns]

In [6]:
df_grouper_no_index = df_grouper.reset_index().filter(['Date Local', 'State', 'NO2 AQI', 'O3 AQI', "SO2 AQI", 'CO AQI'])

In [7]:
df_grouper_no_index

    Date Local    State    NO2 AQI     O3 AQI    SO2 AQI    CO AQI
0   2013-12-31  Alabama  21.387097  18.903226   6.580645  4.129032
1   2014-12-31  Alabama  21.486755  36.947020   7.956954  3.715232
2   2015-12-31  Alabama  20.026667  37.343333   6.950000  3.933333
3   2016-12-31  Alabama  23.093960  39.295302   5.275168  3.906040
4   2014-12-31   Alaska  21.167598  15.206704  14.000000  6.983240
..         ...      ...        ...        ...        ...       ...
491 2012-12-31  Wyoming  11.709722  40.455556   3.986111  2.636111
492 2013-12-31  Wyoming  11.217270  41.284123   0.690808  0.824022
493 2014-12-31  Wyoming   8.967816  44.809195   0.547126  0.442396
494 2015-12-31  Wyoming   9.371058  43.035250   1.916512  0.713755
495 2016-12-31  Wyoming  10.288889  41.077778   0.200000  1.155556

[496 rows x 6 columns]

In [8]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [9]:
df_grouper_no_index

    Date Local    State    NO2 AQI     O3 AQI    SO2 AQI    CO AQI
0   2013-12-31  Alabama  21.387097  18.903226   6.580645  4.129032
1   2014-12-31  Alabama  21.486755  36.947020   7.956954  3.715232
2   2015-12-31  Alabama  20.026667  37.343333   6.950000  3.933333
3   2016-12-31  Alabama  23.093960  39.295302   5.275168  3.906040
4   2014-12-31   Alaska  21.167598  15.206704  14.000000  6.983240
..         ...      ...        ...        ...        ...       ...
491 2012-12-31  Wyoming  11.709722  40.455556   3.986111  2.636111
492 2013-12-31  Wyoming  11.217270  41.284123   0.690808  0.824022
493 2014-12-31  Wyoming   8.967816  44.809195   0.547126  0.442396
494 2015-12-31  Wyoming   9.371058  43.035250   1.916512  0.713755
495 2016-12-31  Wyoming  10.288889  41.077778   0.200000  1.155556

[496 rows x 6 columns]

In [10]:
df_grouper_no_index = df_grouper_no_index[df_grouper_no_index['State']!= 'Country Of Mexico']
df_grouper_no_index = df_grouper_no_index[df_grouper_no_index['State']!= 'District Of Columbia']
df_grouper_no_index['code'] = df_grouper_no_index.State.apply(lambda x: us_state_abbrev[x])

In [11]:
# add county id column to df
county_id = []

for i in range(len(aqi_df)):
    county_id.append(i)
aqi_df['county_id'] = county_id



# rename cols
aqi_df = aqi_df.rename(columns = {'county_id':'county_id','Date Local':'date', 'State':'state', 'County':'county',
       'NO2 AQI': 'no2_aqi', 'O3 AQI': 'o3_aqi',
       'SO2 AQI': 'so2_aqi',
       'CO AQI':'co_aqi'}).copy()


engine = create_engine(f"postgresql://postgres:{pw}@localhost:5432/AQI_US_2000_2016")

# Use pandas to load df into database
aqi_df.to_sql(name='aqi', con=engine, if_exists='replace', index=False) 

# set primary key
with engine.connect() as con:
    con.execute('ALTER TABLE aqi ADD PRIMARY KEY (county_id);')

aqi_df.head()

,date,state,county,no2_aqi,o3_aqi,so2_aqi,co_aqi,county_id
0,2000-01-01,Arizona,Maricopa,73.500000,33.500000,8.000000,20.0,0
1,2000-01-01,Arizona,Pima,36.000000,33.000000,6.000000,8.0,1
2,2000-01-01,California,Contra Costa,21.750000,21.000000,4.000000,10.5,2
3,2000-01-01,California,Imperial,23.000000,35.000000,4.000000,9.0,3
4,2000-01-01,California,Los Angeles,41.333333,22.333333,2.666667,34.0,4

In [12]:
index = []

for i in range(len(df_grouper_no_index)):
    index.append(i)
df_grouper_no_index['index'] = index



# rename cols
df_grouper_no_index = df_grouper_no_index.rename(columns = {'county_id':'county_id','Date Local':'date', 'State':'state', 'County':'county',
       'NO2 AQI': 'no2_aqi', 'O3 AQI': 'o3_aqi',
       'SO2 AQI': 'so2_aqi',
       'CO AQI':'co_aqi'}).copy()


engine = create_engine(f"postgresql://postgres:{pw}@localhost:5432/AQI_US_2000_2016")

# Use pandas to load df into database
df_grouper_no_index.to_sql(name='map_grouper', con=engine, if_exists='replace', index=False) 

# set primary key
with engine.connect() as con:
    con.execute('ALTER TABLE map_grouper ADD PRIMARY KEY (index);')

df_grouper_no_index.head()

        date    state    no2_aqi     o3_aqi    so2_aqi    co_aqi code  index
0 2013-12-31  Alabama  21.387097  18.903226   6.580645  4.129032   AL      0
1 2014-12-31  Alabama  21.486755  36.947020   7.956954  3.715232   AL      1
2 2015-12-31  Alabama  20.026667  37.343333   6.950000  3.933333   AL      2
3 2016-12-31  Alabama  23.093960  39.295302   5.275168  3.906040   AL      3
4 2014-12-31   Alaska  21.167598  15.206704  14.000000  6.983240   AK      4

In [13]:
Base = automap_base()
Base.prepare(engine, reflect=True)

In [14]:
AQI_ref = Base.classes.aqi
AQI_map = Base.classes.map_grouper

In [15]:
# Create our session (link) from Python to the DB
session = Session(bind=engine)

In [16]:
inspector = inspect(engine)
columns = inspector.get_columns('map_grouper')
for c in columns:
    print(c['name'], c["type"])

date TIMESTAMP WITHOUT TIME ZONE
state TEXT
no2_aqi DOUBLE PRECISION
o3_aqi DOUBLE PRECISION
so2_aqi DOUBLE PRECISION
co_aqi DOUBLE PRECISION
code TEXT
index BIGINT